[
  {
    "name": "Cocoa Nut Almond Butter",
    "categories": ["Dessert"],
    "versions": [
      {
        "ingredients": [
          "2 tablespoons cocoa powder",
          "1/8 teaspoon salt",
          "1 1/4 cup almonds",
          "2 tablespoons coconut flakes"
        ],
        "instructions": [
          "Add ingredients to blender twister jar.  Blend medium to medium high speed for 40 seconds"
        ]
      }
    ]
  },
  {
    "name": "Chicken or Tuna Sandwich",
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "mayo",
          "salsa (optional)",
          "Tuna or Chicken (canned or sous vide)",
          "Shredded Cheese (optional, mozzarella)",
          "Flour tortilla"
        ],
        "instructions": [
          "Combine and mix tuna, mayo, salsa in bowl",
          "Put mixture onto half of tortilla.  Put cheese on top of tuna",
          "Fold in half, melt on press/grill"
        ]
      }
    ]
  },
  {
    "name": "Turkey Melt",
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "Sliced Turkey",
          "Flatbread",
          "Lettuce",
          "Salad Dressing (Honey Mustard)",
          "Sriracha",
          "Shredded Cheese (cheddar)"
        ],
        "instructions": [
          "Finely chop lettuce.  Add to bowl and mix with salad dressing",
          "Place cheese on flatbread.  Place turkey on cheese.  Place lettuce on turkey",
          "Fold in half and grill/press"
        ]
      }
    ]
  },
  {
    "name": "Avocado Toast",
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "Pickles",
          "Avocado",
          "jarred roasted peppers",
          "bread (regular is fine)"
        ],
        "instructions": [
          "Brush bread with some oil and toast.  Optional, brush with garlic.",
          "Add avocado",
          "Slice and add pickle",
          "Add roasted red peppers"
        ]
      }
    ]
  },
  {
    "name": "Lettuce Wraps",
    "categories": ["Simple", "Thai"],
    "versions": [
      {
        "ingredients": [
          "Roast Beef lunch meat slices",
          "Lettuce",
          "Carrots (shredded)",
          "Sesame Seeds",
          "Soy Sauce"
        ],
        "instructions": [
          "Heat oil in pan and fry/steam carrots to soften.",
          "Shred up roast beef slices, add to carrots, continue to fry to soften the beef.",
          "Add soy sauce and sesame seeds.",
          "Add to lettuce wraps"
        ]
      }
    ]
  },
  {
    "name": "Chili Beef/Pork Lettuce Wraps",
    "categories": ["Thai"],
    "video": "https://www.youtube.com/watch?v=UzFoThs2Qpw",
    "versions": [
      {
        "ingredients": [
          "lettuce (baby gem, napa)",
          "Ground Pork (can be half pork and half beef)",
          "Chili",
          "fish sauce",
          "lime",
          "cilantro",
          "spring onions"
        ],
        "instructions": [
          "Season ground meat.  Add oil to very hot pan and fry meat dark brown and crispy.  Break up with spoon.",
          "Remove and drain off oil through sive.  Wipe out pan.",
          "Add 1tsp sesame oil, chili, ginger, garlic to pan.",
          "Add brown sugar, add back in meat.  Add fish sauce.",
          "Add zest of lime and lime juice.  Add spring onions.",
          "Dipping sauce - 1tsp brown sugar, soy sauce, 1Tbsp sesame oil, 1Tbsp olive oil, 1tsp fish sauce, lime juice",
          "Add diced chili (keep seeds in).  Add diced cilantro"
        ]
      }
    ],
    "notes": [
      "This is awesome!  Maybe a little too intense, don't go crazy on brown sugar."
    ]
  },
  {
    "name": "Lo Mein",
    "categories": ["revise", "Chinese"],
    "versions": [
      {
        "ingredients": [
          "Lo Mein Noodles (or spaghetti)",
          "Pork (Loin, cut to strips)"
        ],
        "instructions": [
          "Cook Pasta, drain, set aside",
          "Heat oil in wok, add pork strips, get color on strips; remove pork strips",
          "Add ginger and garlic to oil.  Cook for a bit.  Add carrot, yellow onion, peppers, cook",
          "Add back in pork strips, add sesame oil, add scallions, add sugar and soy sauce",
          "drop in noodles, mix and serve"
        ]
      }
    ]
  },
  {
    "name": "Beef and Brocolli",
    "categories": ["revise", "Chinese"],
    "versions": [
      {
        "ingredients": [
          "Beef (Rump, tenderloin, ribeye) sliced thin",
          "broccoli"
        ],
        "instructions": [
          "Whisk soy sauce, cornstarch, oyster sauce and cooking wine to make a sauce",
          "Marinade meat in soy sauce and sesame oil",
          "Add water to wok, add broccoli and salt.  Slightly steam broccoli until water is gone",
          "Clear Wok, add oil and beef for color.  Remove beef",
          "Add oil, scallions, ginger and garlic, cook",
          "Add back in broccoli, heat for a bit, add back in beef.  Add sauce, as it heats it will thicken.",
          "Add sesame seeds"
        ]
      }
    ]
  },
  {
    "name": "General Tso's Chicken",
    "categories": ["Chinese"],
    "versions": [
      {
        "ingredients": ["boneless chicken thighs, bite sized pieces"],
        "instructions": [
          "Beat egg, add soy sauce, cornstarch, wine, baking powder.  Mix together.",
          "Add chicken thighs.  Marinade for a few hours",
          "In a clean bowl, add baking powder and cornstarch",
          "In another bowl, mix soy sauce, wine, rice vinegar, sugar, cornstarch, chili flakes",
          "Drege chicken through powder bowl and deep fry it 350-370 degrees",
          "In a wok, heat oil and fry scallions, ginger and garlic",
          "Add sauce, let thicken, add chicken, coat with sauce",
          "Add sesame seeds, serve over rice"
        ]
      }
    ]
  },
  {
    "name": "Gumbo",
    "categories": ["Cold Weather"],
    "notes": [
      "It shares many ingredients with Chicken a la King, so maybe buy ingredients for both at once",
      "Alternate recipe: https://www.youtube.com/watch?v=anKpOdElcZ4"
    ],
    "video": "https://www.youtube.com/watch?v=76JXtB7JFQY",
    "versions": [
      {
        "ingredients": [
          "1 pound chicken thighs",
          "1 pound sausage (andouille, smoked)",
          "oil (grapeseed or vegetable oil for higher smoke point)",
          "celery (2-5 ribs or so)",
          "1-2 green bell pepper",
          "1 yellow onion",
          "1 jalapeno pepper (optional)",
          "amber-style beer (lager, etc)",
          "6 large cloves of garlic or garlic powder",
          "garlic powder, onion powder, w sauce",
          "1 quart stock (chicken or seafood)",
          "fresh thyme",
          "5 bay leaves",
          "creole seasoning",
          "shrimp (optional)",
          "green onions",
          "rice"
        ],
        "instructions": [
          "Season chicken with salt, pepper and oil.  Broil until golden.",
          "Dice onion, green bell pepper, and celery.  Mince jalapeno.  Can use food processor.  Mince garlic",
          "Make a roux.  Melt butter and add oil, add flour.  Keep whisking and cook until dark.  Go low and slow.  Takes about 30 minutes.",
          "Add vegetables, cook them down.",
          "Add 1 cup of beer, cook off alcohol",
          "Add 1 quart stock.",
          "If oil is coming to the surface, you can skim it off here",
          "Add seasonings: salt, pepper, garlic powder, onion powder, w sauce, creole seasoning, 5 bay leaves, thyme, cayenne pepper for optional heat",
          "Let it simmer for 3 hours, stir every 30 minutes.  Skim off fat during simmer.",
          "After done with simmer, add meats: chicken, sausage, shrimp",
          "Serve over rice w/ green onions"
        ]
      }
    ]
  },
  {
    "name": "Chicken A La King",
    "categories": ["Cold Weather"],
    "notes": [
      "It shares many ingredients with Gumbo, so maybe buy ingredients for both at once"
    ],
    "video": "https://www.youtube.com/watch?v=WvO8EuM1egc",
    "versions": [
      {
        "name": "gather",
        "ingredients": [
          "butter",
          "green pepper",
          "orange pepper",
          "red pepper",
          "Fennel",
          "red onion",
          "flour",
          "chicken stock",
          "sherry",
          "chicken pieces",
          "heavy cream",
          "egg yolk",
          "toast"
        ],
        "instructions": []
      },
      {
        "name": "prepare chicken",
        "ingredients": [],
        "instructions": [
          "Cook chicken, let it cool, cut into pieces, save for recipe"
        ]
      },
      {
        "name": "prepare vegetables",
        "ingredients": [],
        "instructions": ["Dice vegetables, peppers, fennel"]
      },
      {
        "name": "make",
        "ingredients": [],
        "instructions": [
          "Put vegetables in pan, cook then down",
          "Dust with some flour, cook out rawness from the flour",
          "Deglaze with stock and sherry, cook off alcohol",
          "Add heavy cream, egg yolk to thicken",
          "Serve over toast"
        ]
      }
    ]
  },
  {
    "name": "Spinach Curry",
    "categories": ["revise", "Indian"],
    "video": "https://www.youtube.com/watch?v=h_qsg8Gof4Q",
    "versions": [
      {
        "ingredients": [
          "2 bags of spinach",
          "fresh chilis",
          "ghee, corriander seeds, cardamon pods, cumin seeds, garam masala",
          "ginger, garlic",
          "onion",
          "lentils (optional)"
        ],
        "instructions": [
          "Heat ghee, add whole corriander seeds, cardamon pods, cumin seeds",
          "Add fresh chilis, onion and salt.  Cook down",
          "Add ginger garlic paste",
          "Add two bags of spinach, add some water and simmer",
          "Add salt and garam masala",
          "(Optional) Add channa dal or lentils.  Add more water",
          "Let it cook for 30 minutes"
        ]
      }
    ],
    "notes": [
      "Way too many spices.  Skip salt or garam masala, or take it easy.  Also, whole spices were annoying to eat around.  Remove them after step 1 probably."
    ]
  },
  {
    "name": "Indian Coconut Curry",
    "video": "https://www.youtube.com/watch?v=h_qsg8Gof4Q",
    "categories": ["Simple", "Indian"],
    "versions": [
      {
        "ingredients": [
          "Butternut squash (or yams or carrots)",
          "Coconut milk",
          "chopped mushrooms (optional)"
        ],
        "instructions": [
          "In a large skillet.  Heat coconut oil.  Add corriander, fenugreek, cinnamon sticks, mustard seeds, dried chilis.  Heat until seeds start to pop.",
          "Add onions. Heat until brown.  Add ginger garlic paste.  Heat for another minute.",
          "Add chopped butternut squash.  Cook for a few minutes",
          "Add coconut milk.  Add turmeric",
          "Add mushrooms, add lime juice",
          "Cover and cook for a few more minutes"
        ]
      }
    ]
  },
  {
    "name": "Indian Eggplant Curry",
    "categories": ["Indian", "Simple"],
    "video": "https://www.youtube.com/watch?v=h_qsg8Gof4Q",
    "versions": [
      {
        "ingredients": ["4 Eggplants", "2 cans diced tomatoes", "cilantro"],
        "instructions": [
          "Poke holes into eggplants, wrape in foil, put into 400F oven for about 90 minutes",
          "In a pot or dutch over, heat ghee and add cardamon pods, cumin seeds, green peppercorn (or black), fresh diced chilis.",
          "Add diced onion and salt, cook for a few minutes",
          "Add ginger garlic paste, cook one minute",
          "Add 2 cans diced tomatoes.  Cook down for 10 minutes.",
          "Scoup out eggplant meat, discard skins.  Add meat to tomato sauce",
          "Add chopped cilantro"
        ]
      }
    ]
  },
  {
    "name": "Glazed Meatballs / Kale salad",
    "video": "https://www.youtube.com/watch?v=Acs7ZnIdo4o",
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "ground chicken: 1 pound",
          "garlic: 3 cloves minced for sauce, 3 cloves minced for kale",
          "green onions: 2 thinly sliced",
          "egg: beaten",
          "kale: 1 bunch stripped",
          "lemon/lime juice",
          "Yogurt, (optional garnish)"
        ],
        "instructions": [
          "Preheat oven to 450F",
          "In small saucepan, add 3/4 cup ketchup, 2 Tbsp honey, 2 Tbsp soy sauce, 3 Tbsp Worchestshire sauce.  Mix and simmer for 2-5 minutes to reduce to glaze.",
          "In a bowl, combine 1 pound ground chicken, 3 cloves garlic, 2 sliced green onions, 1 beaten egg.  Season with salt and pepper and mix with hands.",
          "Form into about 12 balls.  Place onto parchment paper.  Put into oven 15 minutes or until done.",
          "Heat oil in very hot pan, place in kale to get slight char on both sides.",
          "Add 3 cloves garlic and salt to kale.  Add lemon/lime juice.  Stir and place into bowl.",
          "After 15 minutes, remove meatballs from oven, brush with sauce glaze.  Put back into oven under broiler for a couple minutes",
          "Serve meatballs over yogurt on plate as garnish with kale"
        ]
      }
    ]
  },
  {
    "name": "Indian naan",
    "categories": ["revise", "Indian"],
    "video": "https://www.youtube.com/watch?v=h_qsg8Gof4Q",
    "versions": [
      {
        "ingredients": [],
        "instructions": [
          "Roll out dough into discs.  In a cast iron pan, cook dry on one side for 3 minutes on medium heat.",
          "Brush top with ghee, wait for bubbles.  Flip and cook for two minutes on the other side"
        ]
      }
    ]
  },
  {
    "name": "Coconut Chickpea Rice",
    "categories": [],
    "video": "https://www.youtube.com/watch?v=i9EmC0pM1YE",
    "versions": [
      {
        "ingredients": [
          "1 cup basmati rice",
          "1 cup coconut milk",
          "1/2 red onion",
          "1/4 cup peanuts",
          "1 cup broccolini (chopped)",
          "1 tbsp coconut oil",
          "1 cup canned chickpeas",
          "1/2 tbsp garlic powder",
          "1 tsp chili powder",
          "1 tbsp smoked paprika",
          "2 tsp turmeric",
          "generous pinch of salt",
          "1/2 cup shredded coconut",
          "few sprigs cilantro"
        ],
        "instructions": [
          "Place 1 cup of basmati rice into a small sauce pan.  Wash and drain the rice a couple of times to get rid of the excess starch",
          "Toast the rice for a couple of minutes on medium high heat.  Then, add in 1 cup of coconut milk",
          "When the milk starts to bubble, give the rice a good stir to make sure nothing is grabbing the bottom of the pan.  Then, cover and cook on medium low for 15min",
          "Dice the red onion, coarsely chop the peanuts, and chop the broccolini",
          "After 15min, turn the heat off and let the rice steam further for 10min",
          "Heat up a non stick pan on medium heat.  Add the coconut oil",
          "Add the red onion and chickpeas followed by the garlic powder, chili powder, smoked paprika, turmeric, and salt",
          "Add in the hazelnuts and broccolini",
          "Sauté for 3-4min",
          "Add the shredded coconut.  Sauté for another couple of minutes and taste and adjust the seasoning if needed",
          "Plate the rice and add the coconut chickpeas on top.  Garnish with some freshly chopped cilantro"
        ]
      }
    ]
  },
  {
    "name": "Breakfast Casserole",
    "categories": ["Breakfast"],
    "links": [
      "https://sallysbakingaddiction.com/easy-make-ahead-breakfast-casserole/"
    ],
    "versions": [
      {
        "ingredients": [
          "3/4 pound uncooked sausage, casings removed (You can use ground turkey, ground beef or ground chicken instead)",
          "optional: 1 teaspoon dried rosemary to give the sausage more flavor",
          "2 bell peppers, diced (any color you prefer; about 2 cups)",
          "1 cup sliced mushrooms",
          "1 cup fresh spinach",
          "1/2 medium yellow onion, diced",
          "1 teaspoon minced garlic",
          "salt and fresh ground black pepper",
          "4 slices day-old bread (gluten free, whole wheat, white, sourdough, any kind you like)",
          "10 large eggs",
          "1/2 cup milk (I use almond milk, any milk works) (Mom used a can of coconut milk)",
          "1/2 cup shredded cheese - any works - pepper jack, mozzarella, gouda, swiss, cheddar"
        ],
        "instructions": [
          "Set a large skillet over medium heat and coat it with nonstick spray or a drizzle of olive oil. Place sausage in the skillet and begin to break it up with a spatula or fork. Stir in the rosemary and brown the sausage, about 6-7 minutes.",
          "Meanwhile, set a 2nd skillet over medium heat and coat it with nonstick spray or a drizzle of olive oil. (If you have a skillet large enough to fit both the sausage and veggies, you can just add the veggies to the sausage that is browning in step 1.) Add the peppers, mushrooms, spinach, onion, garlic, and a sprinkle each of salt and pepper. Begin stirring and cooking the veggies down until tender, about 6-8 minutes.",
          "Set sausage and veggies aside.",
          "Generously grease a 9×13 baking pan. Break the bread into pieces and place in the pan in an even layer.",
          "In a large bowl, whisk the eggs, milk, and 1/4 cup shredded cheese together. Pour half of this egg mixture over the bread. Top with the sausage and vegetables, then the remaining egg mixture and remaining 1/4 cup cheese. Add a sprinkle of salt and pepper on top.",
          "Cover casserole with plastic wrap or aluminum foil and refrigerate for 2 hours or overnight– or up to 1 day. Allow it to come to room temperature before baking.",
          "Preheat the oven to 375°F (191°C). Bake the casserole, uncovered, until the top is golden, edges are crisp, and a toothpick inserted in the center comes out clean– about 40-45 minutes. I like mine on the super crisp side, so I bake it for around 45-50 minutes. Allow to cool for 10 minutes, then slice and serve. Tastes awesome with hot sauce on top.",
          "Leftovers keep well in the refrigerator for up to 5 days. Reheat in the microwave to your liking."
        ]
      }
    ],
    "notes": ["Mom made this for Owen's baptism.  It was great!"]
  },
  {
    "name": "Chicken / Turkey Wraps",
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "chicken or turkey leftovers",
          "pickles",
          "pickled jalapenos",
          "american cheese",
          "barbeque sauce",
          "wraps"
        ],
        "instructions": []
      }
    ],
    "notes": ["Great for leftover chicken or turkey"]
  },
  {
    "name": "Thick Hot Chocolate",
    "notes": [
      "I didn't measure the milk, probably added closer to two cups, and it was still too thick.  1 Tbsp cornstarch was too much.  It was also very sweet (used 72% chocolate).  Probably reduce sugar from 2 Tbsp.",
      "Reduced corstarch and sugar, was better.  maybe reduced cornstarch and sugar too much.  2tsp cornstarch and 4tsp sugar?",
      "Tried with almond milk and no chocolate bar, total failure"
    ],
    "links": ["https://www.youtube.com/watch?v=pn-W0DVQw8Y"],
    "categories": ["Dessert", "Cold Weather"],
    "versions": [
      {
        "ingredients": [
          "Dark Chocolate: 3.5oz chopped",
          "Sugar: 2 Tbsp",
          "Cocoa Powder: 1 Tbsp",
          "Cornstarch: 1 teaspoon",
          "Milk: 1 cup"
        ],
        "instructions": [
          "Add dark chocolate, sugar, cocoa powder and splash of milk to a small saucepan on medium heat.  Stir until melted.",
          "Add in a cup of milk.",
          "In a separate bowl, mix cornstarch and splash of milk to make a slurry.  Add slurry to melted chocolate slowly while stirring.  Stir and heat until thickened."
        ]
      }
    ]
  },
  {
    "name": "Mexican Hot Chocolate",
    "categories": ["Dessert", "Cold Weather"],
    "versions": [
      {
        "name": "8 servings",
        "ingredients": [
          "6 12 oz cans evaporated milk",
          "4 tsp ground cinnamon",
          "1 Tbsp vanilla",
          "1 tsp ground nutmeg",
          "1/4 tsp salt",
          "1/4 tsp chili powder",
          "Pinch cayenne (optional heat)",
          "2 12oz bags semisweet Hershey’s chocolate chips",
          "cinnamon stick (garnish)",
          "Cocoa powder (garnish)"
        ],
        "instructions": [
          "Stovetop: Combine into large pot, heat and stir until chocolate chips are melted, turn heat to low.",
          "Slow cooker: combine and cook on low for 2-3 hours, stir every 15-20 minutes",
          "Serve with dusting of cocoa powder and cinnamon stick"
        ]
      },
      {
        "name": "Double Serving",
        "ingredients": [
          "2 cups milk",
          "2 Tbsp cocoa powder",
          "1 ounce chocolate chips (bittersweet, or sweet and reduce sugar)",
          "2 Tbsp sugar",
          "1/2 tsp ground cinnamon",
          "1/4 tsp vanilla extract",
          "1/8  tsp chili powder",
          "1/8 tsp cayenne",
          "pinch of salt",
          "cinnamon stick (garnish)"
        ],
        "instructions": ["Medium heat until melted, stir, divide into 2 mugs."]
      }
    ]
  },
  {
    "name": "Faux Wendy's Spicy Chicken Sandwich",
    "notes": [
      "This is great, but deep frying is kind of a pain.  Maybe half deep fry?  Added pickeled jalapenos because we had them and they were awesome"
    ],
    "links": ["https://www.youtube.com/watch?v=SDAHsZGJ4AI"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "Chicken Breast",
          "Hot Sauce",
          "egg",
          "Buns",
          "Lettuce",
          "Tomato",
          "mayo",
          "flour, cayenne, paprika, garlic powder, black pepper, salt, vegetable oil"
        ],
        "instructions": [
          "Pound Chicken breasts flat",
          "In a bowl, whisk an egg and hot sauce.",
          "In a second bowl, add flour and cayenne, paprika, garlic powder, black pepper and salt.",
          "Dredge chicken through dry bowl, then wet bowl, then dry again. Freeze chicken if possible.",
          "In a small skillet, heat vegetable oil on medium.  Use enough vegetable oil to almost submerge breasts.  Fry for 3-4 minutes per side.  After pulling out, add salt to fried chicken",
          "Serve on toasted buns with mayo, lettuce and tomato"
        ]
      }
    ]
  },
  {
    "name": "Simple Braised Beef",
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "Tough meat cut: beef or lamb",
          "carrots, onions, celery",
          "aromatics: bay leaves, orange peels"
        ],
        "instructions": [
          "Preheat oven to 350F",
          "Bring meat up to room temperature, season with salt and pepper, fry in a dutch oven to get it charred on all sides",
          "Remove meat, add carrots, onions and celery.  Let cook until carmelized",
          "Add red wine to pot to deglaze.  Let alcohol cook off.",
          "Add water halfway up the pot and bring to a boil",
          "Lower to a simmer, add aromatics and cover.  Move to oven.  Cook for 1-2 hours depending on how much meat you have.  Pull out when tender."
        ]
      }
    ]
  },
  {
    "name": "Spicy Chili Oil",
    "notes": ["Good to use up leftover chicken fat"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "1/2 cup chicken fat",
          "3 cloves garlic, 1\" piece ginger",
          "minced fresh chili",
          "1 Tbsp sesame seeds",
          "pinch of salt"
        ],
        "instructions": [
          "Heat up chicken fat until completely liquified.",
          "In another bowl, add other ingredients, slowly pour liquid chicken into bowl.  Whisk together."
        ]
      }
    ]
  },
  {
    "name": "Garlicky Smashed Cucumbers",
    "notes": ["Good for leftover cucumbers"],
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "6 cucumbers",
          "2 Tbsp spicy chili oil",
          "1 Tbsp sesame oil",
          "salt"
        ],
        "instructions": [
          "Cut cucumber into pieces.  Smash them up to help them absorb other incredients.",
          "Mix it all together.  Season with salt"
        ]
      }
    ]
  },
  {
    "name": "Chicken Tikka Masala",
    "links": ["https://www.youtube.com/watch?v=pFeE8_VqdfA"],
    "categories": ["Indian"],
    "versions": [
      {
        "ingredients": [
          "whole milk yogurt",
          "2 pounds chicken thighs, boneless skinless",
          "basmati rice, cardamon pods",
          "28oz can tomatoes",
          "heavy cream - 1 1/4 cup",
          "cilantro (garnish)",
          "2 chilis",
          "corriander seeds, cumin seeds, garlic, ginger, garam masala, turmeric, butter, paprika, kashmiri chili powder",
          "1 onion"
        ]
      },
      {
        "name": "Curry Paste",
        "instructions": [
          "Toast in a dry pan: 1 Tbsp corriander seeds, 1/2 tsp cumin seeds for a couple minutes, remove from heat and add to bowl.  Add to a blender and break apart the spices.",
          "Add to blender 7 cloves garlic, 2\" knob ginger, 1 Tbsp garam masala, 1 tsp turmeric, 2 chilis de-stemmed, 1/4 cup water. blend it until smooth",
          "Add to blender 2 Tbsp canola oil, keep blending until smooth."
        ]
      },
      {
        "name": "Chicken Marinade",
        "instructions": [
          "Add to a bowl 1 cup plain whole milk yogurt, two Tbsp curry paste, 2tsp kosher salt, whisk together.",
          "Cut 2 pounds boneless skinless chicken thighs into bite sized pieces.  Add to bowl with marinade, cover and put in fridge for 30 minutes to overnight."
        ]
      },
      {
        "name": "Rice",
        "instructions": [
          "In pressure cooker, 1 to 1 ratio of washed basmati rice and water with some cardamon pods.  Cook 6 minutes, natural release about 8 minutes."
        ]
      },
      {
        "name": "Curry",
        "instructions": [
          "Blend 28 oz can whole tomatoes, set aside",
          "In saute pan, heat oil and seer chicken on all sides.  Remove chicken from pan and set aside.",
          "Reduce heat in pan and add 4 Tbsp butter.  Add one diced onion. Cook five minutes",
          "Add all remaining curry paste, add 1 Tbsp paprika, 1 tsp kashmiri chili powder, heat another minute",
          "Add pureed tomatoes. Simmer 10 minutes.",
          "(Optional).  Wait to cool and blend mixture for smoother texture.",
          "Add 1 1/4 cup heavy whipping cream, mix.  Re-add chicken.  Simmer 10 more minutes, serve over rice.  Garnish with cilantro"
        ]
      }
    ]
  },
  {
    "name": "Gordon Ramsay Easy Curry in a hurry",
    "categories": ["Indian"],
    "versions": [
      {
        "ingredients": [
          "red onion",
          "butternut squash, grated",
          "ginger (or ginger garlic paste)",
          "2 fresh chilis",
          "chicken (breast or thighs), diced into bite sized pieces",
          "frozen peas",
          "coconut milk",
          "canned tomatoes",
          "broth (few tablespoons)",
          "curry powder or garam masala, 1 Tbsp",
          "Baby spinach",
          "cilantro (garnish)"
        ],
        "instructions": [
          "In a non-stick pan, add oil and grated butternut squash, salt and curry powder.",
          "Grate the red onion, add to pan, season with more salt and stir",
          "Dice chilis, add to pan.",
          "Microplane grate ginger into pan. (or use paste), stir",
          "Create hole in center of pan, add raw chicken, season with salt, mix into pan",
          "Add peas, add chopped tomatoes, stir.",
          "Add coconut milk, mix",
          "Add broth to loosen curry (water is OK too).  Taste for seasoning.  Let cook for about 6 minutes to let chicken cook.",
          "Add spinach last minute"
        ]
      },
      {
        "name": "Roti bread",
        "instructions": [
          "Mix 1/2 cup flour, pinch of salt, glug of olive oil, 1/2 cup water in a bowl into a dough bowl.  Let rest for 15 minutes.",
          "Cut into four parts, roll each part into flatbread.  In a clean non-stick pan, add pinch of salt, splash of oil, add flatbread, let it bubble up and turn over.",
          "Slice bread into pieces for dipping."
        ]
      }
    ]
  },
  {
    "name": "Caramelized Onion Jam",
    "links": ["https://www.allrecipes.com/recipe/220546/onion-jam/"],
    "notes": ["Great for leftover extra onions"],
    "categories": ["Side Dish"],
    "versions": [
      {
        "ingredients": [
          "1/4 cup vegetable oil",
          "1/2 cup white sugar",
          "4 cups onion, coarsely chopped",
          "1/4 teaspoon salt",
          "ground black pepper to taste",
          "1/2 cup red wine vinegar"
        ],
        "instructions": [
          "Heat vegetable oil and sugar, stirring constantly until sugar is light brown, about 10 minutes.  Mixture will be very hot.",
          "Add diced onions.  Stir constantly for about 15 minutes.",
          "Pour red wine vinegar and let simmer until consistency is jam like, about 30 minutes"
        ]
      }
    ]
  },
  {
    "name": "Onion Pasta",
    "links": ["https://www.allrecipes.com/recipe/11868/onion-pasta/"],
    "notes": ["Great for leftover extra onions"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "1/2 cup olive oil",
          "4 tablespoons butter",
          "5 onions, thinly sliced",
          "1 teaspoon dried basil",
          "1 pinch ground black pepper",
          "1 cup water",
          "1 tablespoon chicken bouillon",
          "1 pound uncooked pasta, cooked according to package directions"
        ],
        "instructions": [
          "Cook pasta",
          "Cook onions in a separate bowl",
          "Add basic, black pepper, water and bouillon.  Simmer 10 minutes",
          "Combine pasta and onion mixture.  Sprinkle with cheese."
        ]
      }
    ]
  },
  {
    "name": "French Onion Soup",
    "categories": ["Slow Cooker", "to try"],
    "notes": [],
    "versions": [
      {
        "name": "Overnight in the slow cooker, caramelize the onions",
        "ingredients": [
          "6 yellow onions (more is great too)",
          "Balsamic vinegar",
          "salt and pepper",
          "1 Tbsp thyme",
          "2 bay leaves",
          "1 Tbsp brown sugar",
          "1 stick butter"
        ],
        "instructions": [
          "Slice onions, add everything to pot and cook overnight on low.",
          "If you're around, you can take off the lid to release steam to aid carmelization.  Just set a reminder to check and stir if you do this"
        ]
      },
      {
        "name": "The next day in the slow cooker",
        "ingredients": [
          "4 cans beef stock",
          "demi glaze (optional)",
          "2 Tbsp Worcestershire sauce",
          "2 Tbsp flour (optional)",
          "1/2 cup alcohol (dry sherry, red wine or dark beer)"
        ],
        "instructions": [
          "Add ingredients to slow cooker, let it cook on low until lunch or dinner"
        ]
      },
      {
        "name": "Serving",
        "ingredients": ["shredded cheese", "toast"],
        "instructions": [
          "Serve with shredded cheese on top.  Toast is a good side dish"
        ]
      }
    ]
  },
  {
    "name": "Breakfast Tacos",
    "links": ["https://www.youtube.com/watch?v=j0gjlSgO7VU"],
    "notes": ["Takes >30 minutes to prepare tortillas"],
    "categories": ["Breakfast"],
    "versions": [
      {
        "name": "Homemade flour tortilla",
        "ingredients": [
          "2 1/2 cups flour",
          "2 tsp kosher salt",
          "1 1/2 tsp baking powder",
          "fat - 1/2 cup, lard, shortening or bacon fat"
        ],
        "instructions": [
          "combine flour, salt and paking powder in bowl.  Whisk together",
          "Add bacon fat and combine into crumbly texture",
          "Add 2/3 cup warm water while stirring to make dough ball.  Leave in bowl, cover with plastic wrap, let it rest at room temperature for 30 minutes.",
          "Divide dough into 12-15 portions.  Preheat cast iron pan to medium high heat.",
          "Roll out tortillas thin and put into dry cast iron pan.  Once bubbled, flip.  About 30 seconds per side.  Put tortillas into dry warm kitchen towell"
        ]
      },
      {
        "name": "Taco 1 - Bacon egg, and cheese",
        "instructions": [
          "Bacon - prepare either in cast iron pan or on baking sheet.  Line baking sheet with foil to collect fat.  Toss into cold oven set to 425F, let it sit for 20-30 minutes or until crispy.",
          "Scrambled eggs - Add enough butter to coat bottom of pan and melt.  Add eggs to a bowl and season with salt and pepper.  Add eggs to hot buttered pan.  Start stirring immediately.  Stop at soft scramble.",
          "Add eggs, shredded cheese and bacon to tortilla"
        ]
      },
      {
        "name": "Taco 2 - Potato, egg, and cheese",
        "instructions": [
          "Grate potato into hash.  Wash potato hash to remove starch.  Place potatoes into towell and ring out as much water as possible.  Season heavily with salt and pepper in bowl.",
          "Heat non-stick skillet, coat with plenty of oil and butter and press potatoes into pan.  Cook until crispy (3-5 minutes), flip, cook other side.  Add salt on top.",
          "Add egg to tortilla, cheese and potatoes"
        ]
      },
      {
        "name": "Taco 3 - Chorizo, egg, cheese, avocado, diced sweet or red onion, cilantro",
        "instructions": [
          "Remove chorizo from sausage skin.  cook until crispy.",
          "In separate non-stick, add oil and/or butter until hot.  Fry one egg per taco",
          "Add egg to taco, then chorizo, cheese, sliced avocado, onion and cilantro"
        ]
      },
      {
        "name": "Taco 4 - Vegetarian Taco - onion, garlic, serrano pepper, avocado, grated cheese, cilantro",
        "instructions": [
          "Dice half an onion, cook in oil/butter, add two cloves garlic and one thinly sliced serrano pepper.  Cook until soft",
          "Add one can of black beans, season with salt/pepper.  Cook for a few more minutes.",
          "Add to blender, puree.  Or just use a potato masher.",
          "Assemble taco - Add puree, avocado slice, cheese, "
        ]
      }
    ]
  },
  {
    "name": "Chicken Fried Rice",
    "notes": ["Good for day-old rice"],
    "links": ["https://www.youtube.com/watch?v=7AxydboW8v8"],
    "categories": ["to try", "Chinese"],
    "versions": [
      {
        "name": "Rice",
        "ingredients": [
          "~2 cups cooked rice is required before starting the rest"
        ]
      },
      {
        "name": "Stir Fry Veggies",
        "ingredients": [
          "1 chicken breast",
          "2 eggs",
          "carrots",
          "1 teaspoon corn starch",
          "1 teaspoon soy sauce",
          "1 teaspoon vegetable oil",
          "pinch of baking soda",
          "1 Tablespoon of garlic, minced",
          "1/4 cup diced onion",
          "1/3 cup green peas",
          "1/2 cup diced carrots"
        ],
        "instructions": [
          "cut chicken breast into small pieces",
          "Marinate chicken with corn starch, soy sauce, vegetable oil and baking soda.  Set aside for 30 minutes",
          "Chop garlic and vegetables",
          "beat two eggs in a bowl",
          "heat up wok, add 1 teaspoon vegetable oil, wait for smoke",
          "add egg, wait for fluffy then mix and break up, remove egg",
          "Add more oil, add chicken pieces for a couple of minutes",
          "push chicken to side, add garlic then vegetables to center of wok",
          "Give vegetables some time in the midle, then mix it all together, add salt"
        ]
      },
      {
        "name": "Cooking the Rice",
        "ingredients": [
          "3 Tablespoons soy sauce (1 light 2 dark if you have it)",
          "diced spring onions"
        ],
        "instructions": [
          "Remove everything from wok, add more oil, add cooked rice, break down big pieces and stir, fry for 3-5 minutes",
          "Add soy sauce and mix fast",
          "Add vegetables, meat, and egg, and mix",
          "Add salt and pepper",
          "Add spring onions just before eating"
        ]
      }
    ]
  },
  {
    "name": "One Pot Lasagna",
    "links": ["https://www.youtube.com/watch?v=cs8OYby6RrA"],
    "categories": ["italian"],
    "versions": [
      {
        "ingredients": [
          "10 sheets lasagna",
          "Italian sausage",
          "28oz can crushed tomatoes",
          "8oz can tomato sauce",
          "grated parmesan",
          "8oz mozarella cubed or grated (full fat preferred)",
          "1/2 large onion, chopped",
          "2 cloves garlic"
        ],
        "instructions": [
          "Break lasagna into bite-sized pieces",
          "In large high side pan, add de-cased sausage, break up and mash to add color",
          "Remove sausage from pan and add onion, garlic and red pepper flakes.  Toast for about a minute",
          "Add tomatoes, add sausage back in",
          "Add a half cup of water and lasagna sheets and try to mix back in, top with tomato sauce",
          "Cover and reduce heat to medium low.  cook for 20 minutes and stir occassionally",
          "Add parmesan cheese and mozarella cheese and mix",
          "add ricotta cheese to the top and cover to warm and melt cheese"
        ]
      }
    ]
  },
  {
    "name": "Curried Lentil Soup",
    "links": ["https://justthedarnrecipe.com/curried-lentil-soup"],
    "categories": ["to try", "Cold Weather"],
    "versions": [
      {
        "ingredients": [
          "2 cups (250g) red lentils",
          "32 oz (1L) chicken broth",
          "2 cups (.5L) water",
          "2 tbsp (30ml) olive oil",
          "1/4 cup (60ml) heavy cream",
          "5 cloves garlic",
          "1 tablespoon (15ml) curry powder",
          "1 teaspoon (5ml) black pepper",
          "1 teaspoon (5ml) salt"
        ],
        "instructions": [
          "Heat the olive oil in a stockpot over medium heat.",
          "While the oil is heating up, mince the garlic then add to the pot.",
          "Cook the garlic for approximately 2 minutes until toasted.",
          "Add the lentils along with the chicken broth, water, curry powder, black pepper, and salt, then stir to combine.",
          "Crank up the heat and bring to a simmer, then turn the heat down to low.",
          "Cook for 20 minutes or until the lentils reach desired doneness (we prefer them slightly grainy).",
          "Add the heavy cream, stir, and allow to cool slightly.",
          "Garnish with olive oil, pepper, and green onions if you have them."
        ]
      }
    ]
  },
  {
    "name": "Hummus",
    "categories": ["Simple", "Side Dish"],
    "versions": [
      {
        "ingredients": [
          "1 can chickpeas",
          "1 Tablespoon Tahini",
          "1 Tablespoon Lemon or Lime Juice",
          "Two pinches of salt",
          "Garlic Powder (optional)",
          "1 Tbsp Olive Oil (optional)",
          "Cumin (Optional)"
        ],
        "instructions": [
          "Optional: Drain the chickpeas.  I don't do this normally",
          "Put into blender and blend, taste and add salt",
          "(Optional) Top with paprika and olive oil"
        ]
      }
    ]
  },
  {
    "name": "Lentil Tacos",
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "Flour tortillas",
          "1 cup lentils",
          "1 small onion",
          "1 small red bell pepper",
          "1 small can of corn",
          "14oz can green chilies",
          "1.5 Tablespoons of taco seasoning",
          "1/2 cup sour cream",
          "1 lime"
        ],
        "instructions": [
          "Mix all ingredients other than sour cream in a pan",
          "Combine sour cream, lime juice and water to make a smooth creamy topping"
        ]
      }
    ]
  },
  {
    "name": "Kale Chips",
    "links": [
      "https://downshiftology.com/recipes/how-to-make-crispy-kale-chips/"
    ],
    "categories": [],
    "versions": [
      {
        "instructions": [
          "Preheat oven to 250F",
          "Wash and dry the kale completely dry.  Remove stems",
          "Add 1-2 tsp olive oil and sea salt.  Too much oil prevents kale from crisping.",
          "Cook in oven.  Will take about 15 minutes.  Keep an eye on them to make sure they don't burn."
        ]
      }
    ]
  },
  {
    "name": "Sweet and Sour Chicken",
    "links": ["https://www.youtube.com/watch?v=lxXN4JOX4ak"],
    "categories": ["Chinese"],
    "versions": [
      {
        "ingredients": [
          "Chicken Thighs, cut into bite sized pieces",
          "20oz can of pineapple slices",
          "green pepper, diced",
          "red food coloring",
          "sugar, vinegar, cornstarch, baking powder, egg"
        ]
      },
      {
        "name": "Chicken Thighs",
        "instructions": [
          "Make a batter with corn starch (about 1 cup), baking powder (1/2 tsp), salt, add water and whisk in egg to make batter-like consistency.",
          "Coat chicken in batter and semi-deep fry in about 1 inch of oil"
        ]
      },
      {
        "name": "Finishing",
        "instructions": [
          "Drain pineapple juice from can into saucepan, add sugar, vinegar, salt, red food coloring.  Separately combine cornstarch (2Tbsp) and water into slurry, add to sauce to thicken.  Heat sauce to simmer.",
          "Add sauce, green pepper and pineapple to wok.  Don't cook too long, keep vegetables and chicken crispy",
          "Serve with rice"
        ]
      }
    ]
  },
  {
    "name": "Pickled carrots",
    "links": ["https://www.youtube.com/watch?v=NOgPQvUWfHk"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "2-4 carrots, enough to fill non-metal jar",
          "white vinegar, 1/2 cup",
          "1.5 Tbsp sugar",
          "1 tsp salt"
        ],
        "instructions": [
          "Cut carrot into strips, place into jar",
          "Fill jar 1/3 cup boiling water, 1/2 cup vinegar, put sugar and salt on top. Put on lid and shake"
        ]
      }
    ]
  },
  {
    "name": "Macaroni Chili",
    "links": [
      "https://www.pickuplimes.com/single-post/2020/01/23/Macaroni-Chili"
    ],
    "categories": ["Cold Weather"],
    "versions": [
      {
        "ingredients": [
          "Macaroni Noodles, 2 cups, dry whole wheat preferred",
          "vegetable oil, 1 Tbsp",
          "onion, diced",
          "garlic, 2 cloves, minced",
          "diced tomatoes, 1 can",
          "Tomato paste, 2 Tbsp",
          "bouillon cube",
          "hot chili powder, 1 tsp",
          "paprika, 1 tsp",
          "salt, 1 tsp",
          "black pepper, 1/2 tsp",
          "ground beef or ground soy, 1/2 pound or 1 1/2 cups",
          "carrots, 2 diced",
          "red bell pepper, diced",
          "kidney beans, 1 can, rinsed",
          "fresh spinach, 1/2 bag to a bag"
        ]
      },
      {
        "name": "Optional Toppics",
        "ingredients": ["chives", "jalapeño slices"]
      },
      {
        "instructions": [
          "Cook macaroni but leave al dente, drain.",
          "In a large pot, saute onions, add garlic, deglaze with water",
          "Add diced tomatoes, rinse out can with water and add to the pot.  Add tomato paste, bouillon cube and spice, bring to a boil.",
          "Add protein, carrots, bell pepper and kidney beans, cook until carrots are soft (~5 minutes)",
          "Add drained macaroni and spinach.  Serve with garnish."
        ]
      }
    ]
  },
  {
    "name": "Channa Dal / Lentils",
    "links": ["https://www.youtube.com/watch?v=NOgPQvUWfHk"],
    "categories": ["Cold Weather"],
    "versions": [
      {
        "ingredients": [
          "Extra vegetables: zuccini, cauliflower, brocolli, tomatoes, peppers",
          "lentils, 1 1/2 cups",
          "onions, 2 medium or 1 large, diced",
          "garlic, 4 cloves minced",
          "ginger, 1 chuck chopped, or paste",
          "chili pepper, 2 diced",
          "curry powder, 1 Tbsp",
          "turmeric, 2 tsp",
          "garam masala, 1 tsp",
          "salt, 1/2 tsp",
          "boullion cube",
          "rice",
          "coconut milk, 1 can"
        ],
        "instructions": [
          "Saute onions until they're golden, deglaze as need",
          "Add garlic, ginger and chili, saute for a few more minutes then drop heat to medium",
          "Add spices, mix well",
          "Add 2 cups boiling water, boullion cube and lentils, simmer for 25 minutes, stirring occassionally",
          "Dice extra vegetables, add to pot with coconut milk, mix, cook for another 10 minutes with pot uncovered",
          "Serve with rice "
        ]
      }
    ]
  },
  {
    "name": "Shepherd's Pie",
    "links": ["https://www.youtube.com/watch?v=zXQ9wX4cKlQ"],
    "categories": ["Cold Weather"],
    "versions": [
      {
        "ingredients": [
          "russet potatoes, 2.5 pounds, peeled, diced",
          "cheese, grueyere preferred for potatoes, parmesan for top",
          "ground beef, 1 1/2 pounds",
          "mushrooms, 6 diced",
          "thyme, chopped, ~1 Tbsp",
          "rosemary, chopped, ~1 Tbsp",
          "beef stock, 1 cup",
          "yellow onion, diced",
          "celery, 1 rib, diced",
          "carrot, 1 large, diced",
          "garlic, 4 cloves, diced",
          "Tomato paste, 2 Tbsp",
          "red wine, 1/2 cup",
          "worchestershire sauce, 2 Tbsp",
          "frozen peas, 1 cup",
          "butter",
          "whole milk, 1/2 cup"
        ],
        "instructions": [
          "Peel potatoes, dice into large chunks, boil until piercable then drain and mash.",
          "Add butter (8 Tbsp) and milk (1/2 cup) to saucepan, heat until butter melted, add to mashed potatoes.  Grate in cheese.  Season with salt and pepper",
          "Add ground beef to dutch oven and brown.  Mash it up w/ potato masher, season w/ salt and pepper.  Dump out ground beef.",
          "Add 1 Tbsp butter to empty dutch oven.  Melt the butter and add diced mushrooms, let them brown.",
          "Add onion, celery, carrot and garlic.  Season with salt and pepper.  Let soften for a few minutes.  Not too long or pie will be too mushy",
          "Add tomato paste, saute for a couple of minutes, deglaze with red wine, add worchestershire sauce, bring to a boil",
          "Preheat oven to 375F",
          "Add thyme and rosemary, reduce until liquid is gone.  Add beef stock and frozen peas.  Once peas are added, ready for caserole dish",
          "Add mixture to casterole dish, pack it in tight and spread it out, add mashed potatoes, spread them on top.  Grate plenty of cheese on top.  Pop into preheated oven for 20 minutes or until top is brown.",
          "Let sit for 20 minutes"
        ]
      }
    ]
  },
  {
    "name": "Chocolate Mousse",
    "links": ["https://www.youtube.com/watch?v=czPV8PpyqvM"],
    "categories": ["Dessert"],
    "versions": [
      {
        "ingredients": ["Ricotta cheese", "Semi sweet chocolate chips"],
        "instructions": [
          "Add 2 cups ricotta cheese to food processor.  Process until smooth",
          "Add 3 Tbsp sugar. Pinch of salt",
          "Melt 4oz semi sweet chocolate chips. Add to food processor"
        ]
      }
    ]
  },
  {
    "name": "Pancakes",
    "links": ["https://www.youtube.com/watch?v=IY5ykPd3coo"],
    "versions": [
      {
        "ingredients": [
          "2 Tablespoons butter",
          "2 Tablespoons sugar",
          "1 egg",
          "splash vanilla",
          "1 heaped Tablespoon baking powder",
          "water or milk",
          "Flour, bread or regular (almond flour won't work)"
        ],
        "instructions": [
          "Barely melt butter into big pyrex jug (~30 seconds)",
          "Add sugar, whish with fork",
          "Add egg and a splash of vanilla, 1 teaspoon of salt, 1 Tablespoon of baking powder, whisk together",
          "Add liquid to fill to 2 cup line",
          "Add flour, about 1 cup and a half, until consistency like pancakes, fold with liquid"
        ]
      }
    ]
  },
  {
    "name": "Pizza!",
    "links": ["https://www.youtube.com/watch?v=9TjUWnAK0cg"],
    "categories": ["Simple"],
    "versions": [
      {
        "name": "Dough",
        "ingredients": [
          "1 cup bread flour",
          "1/2 teaspoon salt",
          "1/2 teaspoon sugar",
          "1/2 teaspoon dry yeast",
          "glug of olive oil (~2 teaspoons)",
          "garlic powder",
          "1/2 cup water"
        ],
        "instructions": [
          "mix ingredients",
          "Form into a ball, put back in bowl, let it rise on the counter for an hour or two (or let rise in the fridge overnight)",
          "Put some olive oil into a nonstick pan.  Add oregano, basil, salt, chili flakes, coat the bottom of pan",
          "Place dough onto pan, stretch into to edges. Rub olive oil on top.  Let it rise in the pan for ~30 minutes"
        ]
      },
      {
        "name": "Sauce",
        "ingredients": [
          "~1/3 cup crushed or ground tomatoes",
          "marjoram, oregano, basil, chili flakes, sugar, black pepper, olive oil"
        ],
        "instructions": ["Mix together"]
      },
      {
        "name": "Pizza!",
        "ingredients": [
          "Shredded Mozzarella.  Low-Moisture Part-Skim is best.  Grate it yourself",
          "Fake Parmesan Cheese"
        ],
        "instructions": [
          "Heat dough in pan on range without any toppings applied until bottom is brown",
          "Add sauce, cheese, toppings",
          "Place under broiler"
        ]
      }
    ]
  },
  {
    "name": "Filipino-style Picadillo",
    "links": ["https://www.youtube.com/watch?v=ZUFIQpbr9Fs"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "1 tablespoon canola oil",
          "1 onion, peeled and chopped",
          "2 cloves garlic, peeled and minced",
          "1 1/2 pounds ground beef",
          "2 tablespoons fish sauce",
          "1 cup tomato sauce",
          "1/2 cup crushed tomatoes",
          "1/2 cup water or beef broth",
          "2 medium potatoes, peeled and cubed",
          "peas and carrots",
          "2 tablespoons raisins",
          "salt and pepper to taste"
        ],
        "instructions": [
          "In a pan over medium heat, heat oil. Add onions and garlic and cook until limp.",
          "Add ground beef and cook, breaking to pieces with the back of a spoon, until lightly browned. Drain excess fat, if any. ",
          "Add fish sauce and cook for about 1 to 2 minutes.",
          "Add tomato sauce and crushed tomatoes.",
          "Add water and bring to a boil. Lower heat, cover and cook for about 10 to 15 minutes or until beef is cooked through. ",
          "Add potatoes, carrots, peas, raisins. Cover and continue to simmer for about 3 to 5 minutes or until tender. ",
          "Continue to cook until sauce is reduced and thickened. Season with salt and pepper to taste."
        ]
      }
    ]
  },
  {
    "name": "Garlic Naan",
    "links": ["https://www.youtube.com/watch?v=xqBJ0Lv7D-k"],
    "categories": ["to try"],
    "versions": [
      {
        "name": "naan dough",
        "ingredients": [
          "2 tsp active dry yeast",
          "1 tsp sugar",
          "1/2 cup lukewarm water",
          "1 large egg",
          "1/3 cup avocado oil",
          "1/4 cup plain yoghurt",
          "2 3/4 cups ap flour",
          "3/4 tsp salt"
        ]
      },
      {
        "name": "garlic butter",
        "ingredients": [
          "1 stick unsalted butter",
          "3 cloves minced garlic",
          "3/4 cup chopped cilantro",
          "salt and pepper to taste"
        ]
      },
      {
        "instructions": [
          "Add water, sugar and yeast to mixing bowl, light mix, add oil, egg and yogurt, whisk together",
          "Lay flour on table, make well in center, pour wet into middle, knead the dough, add more flour if too sticky",
          "Form into ball, place into bowl, cover with towel, leave somewhere warm to rise",
          "Cut dough into eight pieces, roll into flat circles",
          "Heat cast iron, place dough onto dry pan, cook for about one minute, see bubbles form, flip, another minute of heat",
          "Brush with garlic butter and add flaky salt"
        ]
      }
    ]
  },
  {
    "name": "Shrimp sheet pan dinner",
    "links": ["https://www.youtube.com/watch?v=L-mA3UCTDPI"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "1 lb (454g) shrimp (bigger ones are more likely to cook in the same time as the veggies)",
          "1 lb (454g) asparagus",
          "2 ears fresh sweet corn",
          "2-3 shallots",
          "2-3 garlic cloves",
          "1 lemon",
          "salt, pepper, oil and spices (I used garlic powder, onion powder and smoked paprika)",
          "fresh herb for garnish (I used lemon balm but parsley would be good)"
        ]
      }
    ]
  },
  {
    "name": "Focaccia bread",
    "links": ["https://youtube.com/shorts/AB3-RdmHKJE?feature=share"],
    "categories": [],
    "versions": [
      {
        "ingredients": [],
        "instructions": []
      }
    ]
  },
  {
    "name": "Mississippi Chicken",
    "links": ["https://www.plainchicken.com/oven-baked-mississippi-chicken/"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "Four pieces chicken (breast or any)",
          "1 packet ranch dressing",
          "1 package au jus gravy mix",
          "1/3 cup pepperoncini peppers or banana peppers",
          "1/2 cup butter, sliced"
        ],
        "instructions": [
          "Preheat oven to 425.  Spray 9x13 pan",
          "Place chicken in dish, sprinkle with ranch seasoning and au jus",
          "top with peppers and butter",
          "bake for 25-30 minutes or until chicken is 165 internal"
        ]
      }
    ]
  },
  {
    "name": "Everything Sauce",
    "links": ["https://www.youtube.com/watch?v=cNElghlPe54"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "Sour Cream (2 cups)",
          "Ketchup (1/2 cup)",
          "Mayo (1/2 cup)",
          "Worchestershire sauce (2 tablespoons)",
          "veggie oil (2 tablespoons)",
          "mustard (1 tablespoon)",
          "garlic powder (1 teaspoon)",
          "paprika (1 teaspoon)",
          "seasoning salt (1 teaspoon)"
        ],
        "instructions": []
      }
    ]
  },
  {
    "name": "Butter Chicken",
    "links": ["https://www.youtube.com/watch?v=ybpDRnVRtv4"],
    "notes": [
      "It was okay but tasted a little heavy.  Maybe more tomatoes and onions.  Keep looking"
    ],
    "categories": ["Indian"],
    "versions": [
      {
        "name": "Marinade",
        "ingredients": [
          "1 cup yogurt ",
          "4 cloves garlic ",
          "1 Tbsp ginger ",
          "1 tsp salt ",
          "1 tsp paprika ",
          "1 tsp red chili powder ",
          "1 tsp Garam Masala ",
          "1/2 tsp cayenne pepper "
        ],
        "instructions": []
      },
      {
        "name": "Main Dish",
        "ingredients": [
          "4tbsp butter",
          "1/2 large onion ",
          "2 tsp Garam Masala ",
          "1 tsp red chili powder ",
          "4 cloves garlic ",
          "1 Tbsp ginger ",
          "1 can diced tomatoes (15 oz) ",
          "1/3 cup cashews ",
          "1/2 cup heavy cream "
        ],
        "instructions": []
      }
    ]
  },
  {
    "name": "Smashed Burger",
    "links": ["https://www.youtube.com/watch?v=lo8GVZkYEHE"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "Brioche Buns",
          "Ground beef (lean preferred)",
          "American cheese",
          "Onion"
        ],
        "instructions": [
          "Heat a cast iron skillet",
          "toast your buns",
          "Carmelize onions with salt.  To speed up process, you can add some sugar",
          "Remove onions and get the skillet hot, add burgers and smush them down",
          "Season with salt and pepper",
          "Flip, season again, cook a bit, then add cheese to melt"
        ]
      }
    ]
  },
  {
    "name": "Breakfast Burritos",
    "links": ["https://www.youtube.com/watch?v=ShKEzA9wo_I"],
    "categories": ["Breakfast"],
    "versions": [
      {
        "name": "Night before prep",
        "ingredients": [
          "breakfast sausage or ground beef",
          "bell pepper",
          "1/2 onion",
          "potato",
          "2 Jalapenos"
        ],
        "instructions": [
          "Break down sausage and fry.  Remove from pan.",
          "Dice potatoes into small cubes and fry until golden",
          "Dice and Saute veggies",
          "Mix them all together and store separately"
        ]
      },
      {
        "name": "Tortillas",
        "ingredients": [
          "10 oz AP Flour (2 Cups plus 2 tablespoons)",
          "3 oz or 1/2 Cup of Lard, Bacon Fat, butter or Veg Shortening, melted",
          "5 oz or 1/2 Cup plus 2 tablespoons of Warm Water around 150˚F",
          "1 1/4 teaspoon Baking Powder",
          "1 1/2 teaspoon of Salt"
        ],
        "instructions": [
          "Measure out the ingredients and add the dry ingredients into a mixing bowl or stand mixer. Whisk together. Using a stand mixer or food processor, set it to lower and slowly stream in the melted fat until it's absorbed by the flour. Next do the same with the water. Once all the ingredients are in the mixer, increase the speed slightly and allow the dough to knead for 5-10 minutes. Then place in plastic wrap and allow to rest at room temp for 2 hours.",
          "After 2 hours, divide the dough into 8 equal pieces and roll those into balls and then allow those to rest under plastic wrap for 30 more minutes.",
          "After resting, using a rolling pin and a lightly floured surface, roll the dough out as thin as possible. Roll from the center of the dough out and rotate to make sure you maintain a round shape. You want the dough to be paper thin so once you roll it out as thin as you can on the board, tear a few large wax paper sheets and place the rolled out tortilla on to one of the sheets, then place another sheet on top and then continue to roll out the dough a bit more as much as you can, then set aside and repeat with the rest of the dough balls, and continuing to add layers to the wax paper and as you roll the dough with the wax paper, there’s a bit of compression that happens that helps get the dough sheets to the proper thinness. Then set aside while you preheat a large cast iron pan. If your pan is smaller, flip it upside down and use the bottom of the cast iron to cook the tortillas.",
          "Once hot, add the tortillas one at a time to the cast iron and it will only need to cook for 20-30 seconds if the pan is hot enough. It should instantly start to bubble. After 20-30 seconds, flip and cook the other side for another 20 seconds and then get it out of the pan and into a towel in a pot to steam and continue to soften. Repeat with the rest of the tortillas. If your pan isn’t hot enough or you cook them too long, the tortillas will dry out and become brittle, making them hard to roll into burritos.",
          "Set aside until ready to use. Store in the fridge in a large ziplock, for up to a week."
        ]
      },
      {
        "name": "Putting it all together",
        "ingredients": ["eggs", "american cheese"],
        "instructions": [
          "Scramble eggs",
          "Heat up veggie, potato, meat mixture",
          "Add all to tortilla"
        ]
      }
    ]
  },
  {
    "name": "Sloppy Joes",
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "ground meat",
          "bell peppers",
          "onion",
          "tomato sauce",
          "garlic",
          "ketchup",
          "brown sugar",
          "Worcestershire sauce",
          "black pepper",
          "red pepper flakes",
          "buns"
        ],
        "instructions": []
      }
    ]
  },
  {
    "name": "Golden milk",
    "links": ["https://minimalistbaker.com/5-minute-vegan-golden-milk/"],
    "categories": ["Dessert", "Cold Weather", "to try"],
    "versions": [
      {
        "ingredients": [
          "1 ½ cups light coconut milk (canned is best, but carton or homemade works too)",
          "1 ½ cups unsweetened plain almond milk (DIY or store-bought)",
          "1 ½ tsp ground turmeric",
          "1/4 tsp ground ginger (or 1 tsp freshly grated ginger*)",
          "1 whole cinnamon stick (or 1/4 tsp ground cinnamon)",
          "1 Tbsp coconut oil (optional for richness // see notes for oil-free)",
          "1 pinch ground black pepper",
          "Sweetener of choice (i.e. maple syrup, coconut sugar, or stevia to taste)"
        ],
        "instructions": [
          "To a small saucepan, add coconut milk, almond milk, turmeric, ginger, cinnamon, coconut oil (optional), black pepper, and sweetener of choice (I usually add 1 Tbsp (15 ml) maple syrup // adjust amount if altering number of servings).",
          "Whisk to combine and warm over medium heat. Heat until hot to the touch but not boiling – about 4 minutes – whisking frequently.",
          "Turn off heat and taste to adjust flavor. Add more sweetener to taste or more turmeric or ginger for intense spice + flavor.",
          "Serve immediately, dividing between two glasses and leaving the cinnamon stick behind. Best when fresh, though leftovers can be stored covered in the refrigerator for 2-3 days. Reheat on the stovetop or microwave until hot."
        ]
      }
    ]
  },
  {
    "name": "Beef Enchiladas",
    "links": ["https://www.onceuponachef.com/recipes/beef-enchiladas.html"],
    "categories": ["Cold Weather", "to try"],
    "versions": [
      {
        "ingredients": [
          "ground beef",
          "tortillas",
          "onion",
          "jalapenos",
          "shredded mexican cheese",
          "baking soda",
          "chicken broth",
          "tomato sauce",
          "garlic",
          "chili powder",
          "cumin",
          "oregano",
          "flour"
        ],
        "instructions": [
          "Tenderize the Meat: In a medium bowl, combine the beef, baking soda, and salt. beef, salt, baking soda in bowl. Mash with your hands until evenly combined and let sit on the counter for at least 20 minutes. As it rests, the baking soda raises the pH of the meat, helping to lock in moisture and making the beef tender.",
          "Prep: While the beef rests, chop the onion, jalapeño, and garlic and prep your other ingredients.",
          "Make the Sauce: Heat the oil in a large nonstick skillet over medium-high heat and add the meat.  Cook, breaking it up with a wooden spoon, until browned, about 5 minutes. Using a slotted spoon, transfer the browned meat to a plate.  Add the onion, jalapeño pepper, and garlic to the skillet.  Cook, stirring frequently, until the onion is softened, 3 to 4 minutes. Do not brown; reduce the heat if necessary.",
          "Add the chili powder, cumin, oregano, and flour. adding spices and flour to the pan.  Cook, stirring constantly, to toast the flour and spices for 1 minute more.  Stir in the tomato sauce.  Gradually pour in the chicken broth, stirring to combine.  Add the beef.",
          "Bring to a boil, then reduce the heat and vigorously simmer until the sauce is thickened, 12 to 14 minutes. Taste and adjust the seasoning, if necessary.",
          "Soften the Tortillas: Pour the oil into a small bowl or ramekin. Using a pastry brush, brush both sides of each tortilla with oil, then stack them on a plate and microwave until hot and steamy, about 1-1/2 minutes. This makes them pliable; if you skip this step, they’ll likely tear when you roll them.brushing corn tortillas with oil",
          "Assemble the Enchiladas and Bake. Spoon about 1 cup of the sauce evenly into the bottom of a 13×9-inch baking dish.",
          "Working directly on the stack of tortillas, put about 3 tablespoons of cheese and 2 generous tablespoons of the sauce in the center of the top tortilla.",
          "Place it seam-side down in the pan, and repeat with the remaining tortillas, nestling each one against the last. (You’ll have two rows of 5 enchiladas.)",
          "Spoon the remaining sauce over the rolled tortillas and sprinkle with the remaining cheese. (I like to sprinkle the cheese over the center of each row of enchiladas, rather than all over, so that the tortillas are partially exposed during baking.)",
          "Bake until the sauce bubbles and the cheese is melted, about 15 minutes."
        ]
      }
    ]
  },
  {
    "name": "Barbacoa",
    "links": ["https://www.youtube.com/watch?v=VVcRFMG46fg"],
    "categories": ["to try"],
    "versions": [
      {
        "ingredients": [],
        "instructions": []
      }
    ]
  },
  {
    "name": "Lamb Pulao",
    "links": ["https://joshicooks.com/lamb-pulao-instant-pot-recipe/"],
    "categories": [],
    "versions": [
      {
        "ingredients": [],
        "instructions": []
      }
    ]
  },
  {
    "name": "Easy Whole Chicken Stew",
    "links": [
      "https://www.google.com/search?client=firefox-b-1-d&q=chicken+stew+instant+pot"
    ],
    "categories": ["to try"],
    "versions": [
      {
        "ingredients": [],
        "instructions": []
      }
    ]
  },
  {
    "name": "Buffalo Chicken Dip",
    "links": ["https://www.youtube.com/watch?v=uNvQ-YIOaKk"],
    "categories": ["to try", "Simple"],
    "versions": [
      {
        "ingredients": [
          "2 cans chicken (12.5oz can)",
          "cream cheese block",
          "hot sauce",
          "ranch seasoning packet",
          "shredded cheese (mozzarella or other)",
          "red peppers (for dipping)"
        ],
        "instructions": ["throw ingredients into crock pot"]
      }
    ]
  },
  {
    "name": "Lamb Pulao",
    "links": ["https://www.youtube.com/watch?v=320aYegXP-g"],
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "1/2 tbsp Black Pepper Corns",
          "1 tbsp Cumin Seeds",
          "1 tbsp Coriander Seeds",
          "1 Cinnamon Stick",
          "3 Black Cardamom Pods",
          "5 Cardamom pods",
          "1/2 tsp cloves",
          "2 small Onions",
          "1 whole head of Garlic",
          "3 lbs Lamb Shoulder",
          "1/2 cup canola oil",
          "1 tbsp Ginger Turmeric and Garlic Paste.",
          "3 cups of washed Basmati rice"
        ],
        "instructions": [
          "Preparation Begin by making a stock. Grab a large pot on low-medium heat and add black pepper corns, cumin and coriander seeds, cinnamon sticks, cardamom pods, and cloves. After a few minutes the spices should be toasted and fragrant.",
          "Add in 1 whole onion, 1 whole garlic, lamb and salt, submerge everything so it's just covered with water. Cover it on medium heat and cook for 1 hour.",
          "Taste the broth for seasoning. Remove the meat, onions, and garlic and strain the stock.",
          "In the same pot on medium heat, add back the garlic and onion that you previously used, along with one freshly slices onion, ginger/turmeric/garlic paste, and some oil. Mix for a couple of minutes.",
          "Bring your lamb back into the pot, and get a bit of colour on your lamb. Add your lamb stock. Bring everything up to a boil and then add 3 cups of washed basmati rice and mix.",
          "Cook on medium-high heat until the broth is bubbling just below the rice. Cover it and let this steam on low-medium heat for about 10 minutes. Plate and garnish with raita yogurt."
        ]
      }
    ]
  },
  {
    "name": "Crockpot Barbacoa",
    "links": ["https://www.youtube.com/watch?v=VVcRFMG46fg"],
    "categories": ["to try", "Simple"],
    "versions": [
      {
        "ingredients": [
          "Chuck Roast (~2.5 pounds), cut into chunks",
          "4 peppers and 2 Tbsp sauce from can chipotle peppers in adobo sauce, (chop them up manually)",
          "3 bay leaves",
          "1 onion, dice",
          "6 cloves garlic diced",
          "juice of 1 lime",
          "1 Tbsp cumin",
          "1 Tbsp beef boullion",
          "1 Tbsp oregano",
          "1 Tbsp apple cider vinegar",
          "salt and pepper",
          "1 cup beef broth"
        ],
        "instructions": ["throw all into crock pot", "cook on low 6-8 hours"]
      }
    ]
  },
  {
    "name": "Butter Chicken (Jamie Oliver)",
    "links": ["https://www.youtube.com/watch?v=JKs-cRneTyE"],
    "notes": ["Pretty good"],
    "categories": ["Indian"],
    "versions": [
      {
        "name": "Ingredients",
        "ingredients": [
          "Chicken Thighs",
          "1 ½ tbsp unsalted butter",
          "5 green cardamom pods lightly crushed",
          "1” cinnamon stick",
          "4 cloves",
          "1 small onion finely chopped",
          "1 heaped tbsp grated ginger",
          "2 green chillies slit lengthwise",
          "1 tsp kashmiri chilli powder (or mild paprika)",
          "½ tsp garam masala powder",
          "3 tbsp tomato puree",
          "1/2 cup heavy cream",
          "2 tbsp honey",
          "1/2 Tbsp Kasoori methi/ fenugreek leaf powder",
          "Salt to taste",
          "Chopped coriander for garnish"
        ]
      },
      {
        "name": "Prep Marinade",
        "instructions": [
          "wet grind ginger (1 inch piece), garlic (4 cloves), green chilli (1).  Mix well with yogurt(2 Tbsp)",
          "Add chicken in bite size pieces"
        ]
      },
      {
        "name": "Prep Meal",
        "instructions": [
          "Dice onion (1 small)",
          "Grate ginger (1 Tbsp)",
          "grind spices (5 green cardamom, 1 cinnamon stick, 4 cloves",
          "Slice chillies (2)"
        ]
      },
      {
        "name": "Recipe",
        "instructions": [
          "Put chicken on wooden skewers (use two to make flipping easier), heat under grill, keep turning every 15 minutes",
          "Add butter, spice mix and onions to pan.  Heat until light brown",
          "Add ginger (1 Tbsp) and chillies (2), add garam masala (1/2 tsp) and tomato puree (3 Tbsp), add heavy cream (1/2 cup)",
          "Add water if curry is too thick, add honey (2 Tbsp) and fenugreek powder (1/2 Tbsp)",
          "Add cooked chicken and simmar for 10 minutes"
        ]
      }
    ]
  },
  {
    "name": "Healthy Burrito Bowl",
    "categories": [],
    "versions": [
      {
        "ingredients": [
          "riced cauliflower",
          "cherry tomatoes",
          "sliced jalapenos",
          "avocado slices",
          "black beans",
          "cilantro",
          "lime wedges",
          "roasted corn",
          "sliced red onion",
          "shredded cheese",
          "cilantro lime ranch"
        ],
        "instructions": []
      }
    ]
  },
  {
    "name": "Simple Queso",
    "links": ["https://www.youtube.com/watch?v=vhc6331LTIA"],
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "1 pack American cheese",
          "2-3 bell peppers, green, yellow, red",
          "1/2 red onion",
          "jalapenos",
          "Chili Powder",
          "salsa",
          "bacon, optional",
          "milk",
          "hot sauce"
        ],
        "instructions": [
          "Add bacon to pan",
          "saute vegetables",
          "Add flour to absorb excess fat, less greasy, cook flour",
          "deglaze chicken stock, not too much",
          "season with chili powder",
          "Add salsa, cook it down",
          "Add milk",
          "Add cheese, melt it down",
          "Add hot sauce if wanted"
        ]
      }
    ]
  },
  {
    "name": "Homemade English Muffins",
    "links": ["https://www.youtube.com/watch?v=ALR6ARxqyYY&t=55s"],
    "categories": ["Breakfast"],
    "versions": [
      {
        "ingredients": [
          "3/4 cup greek yogurt",
          "1.25 cup water",
          "3 Tbsp neutral oil",
          "yeast - 3/4 tsp instant yeast or 1 tsp active dry yeast",
          "4 cups all purpose flour",
          "1.5 tsp sea salt",
          "2 Tbsp sugar",
          "cornmeal"
        ],
        "instructions": [
          "combine yogurt, water, oil, yeast, flour, salt and sugar in a large bowl, stir into a dough",
          "Let sit out for 30 minutes, stretch and fold (very light mixing). repeat 2 more times, let sit out for one hour, put in fridge for 10 hours (up to 48 hours)",
          "Line a baking pan with cornmeal",
          "Roll into a log and cut dough into 12 pieces.  Form 12 balls, put onto baking pan.  Add cornmeal to tops of balls, cover with plastic wrap, let proof for one or two hours",
          "cook in a skillet, slap them down with a spatula, cover with a lid to capture steam"
        ]
      }
    ]
  },
  {
    "name": "Meatza Pizza Crust",
    "links": ["https://www.youtube.com/watch?v=qmhAuXfTRVg"],
    "notes": ["This was a banger!"],
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "can of chicken",
          "1 egg",
          "half cup paresan cheese (powdered)",
          "pizza spices (dried basil, oregano, etc)"
        ],
        "instructions": [
          "Mix it all together with a mixer",
          "spread onto parchment paper",
          "Bake at 450F for about 20 minutes",
          "Add toppings, broil for two minutes"
        ]
      }
    ]
  },
  {
    "name": "Brazilian Stroganoff",
    "links": [
      "https://braziliankitchenabroad.com/brazilian-chicken-stroganoff-recipe/"
    ],
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "Chicken (breasts or thighs)",
          "Butter",
          "Diced onion",
          "Mminced garlic",
          "Tomato sauce",
          "Ketchup",
          "Heavy cream (or crema)",
          "Salt and pepper",
          "Mushrooms (optional)"
        ],
        "instructions": [
          "Saute chicken, remove chicken from pan",
          "Saute diced onion then garlic",
          "Add tomato sauce, ketchup and cream, simmer",
          "Optionally add mushrooms",
          "Dice the cooked chicken, add back into pan",
          "season with salt and pepper"
        ]
      }
    ]
  },
  {
    "name": "Simple Stir Fry",
    "links": ["https://www.youtube.com/shorts/SvfOK9eKfhg"],
    "categories": ["Simple"],
    "versions": [
      {
        "ingredients": [
          "protein (chicken, beef, pork, shrimp, etc)",
          "white rice",
          "cabbage",
          "spring onions",
          "carrots",
          "zuchini",
          "broccoli",
          "garlic",
          "ginger",
          "soy sauce",
          "stir fry sauce"
        ],
        "instructions": [
          "Make more than enough rice",
          "Fry protein in wok, remove and let sit",
          "Fry hardest vegetables in wok (carrots, onions)",
          "Add ginger, garlic next",
          "add soft vegetables (cabbage, zuchini, brocoli",
          "season with soy sauce",
          "Dice and reintroduce protein",
          "Serve with stir fry sauce on the side"
        ]
      }
    ]
  },
  {
    "name": "Red and Green Salsa",
    "links": ["https://www.youtube.com/watch?v=Hpd_p7LRk_k"],
    "categories": ["Simple", "Side Dish"],
    "versions": [
      {
        "ingredients": [
          "3-5 red tomatoes (cheap is fine, roma)",
          "6 tomatillos",
          "4, 10, or 20 chile de arbol (mild, medium, hot)",
          "pepper (habanero preferred, jalapeno, bell, poblano, serrano, etc works too)",
          "2-4 cloves of garlic",
          "cilantro",
          "1/2 onion"
        ]
      },
      {
        "instructions": [
          "Roast red tomatoes, garlic and onion in pan under broiler, burn them",
          "Boil tomatillos, all chile de arbol, habaneo, drain once water boiling",
          "Put roasted tomatoes into bowl, add half cup water",
          "Green salsa: blend tomatillos, habaneo and half chile de arbol, half garlic, 20 sprigs cilantro, 1/4 onion and salt",
          "Red salsa: Blend red tomatoes, half chile de arbol, half clove garlic, 1/4 onion, oregano"
        ]
      }
    ]
  },
  {
    "name": "Crispy Chicken Tacos",
    "links": ["https://www.youtube.com/watch?v=AhbBmsPcJyo"],
    "categories": [],
    "versions": [
      {
        "name": "Chicken",
        "ingredients": ["chicken thighs (Full pack and/or frozen is fine)"],
        "instructions": [
          "chicken, salt, pepper and garlic powder into slow cooker on low all day"
        ]
      },
      {
        "name": "Consomme",
        "ingredients": [
          "1/2 onion",
          "4 cloves garlic",
          "3 guajillo chilles",
          "2 ancho chilles",
          "10 chile de arbol",
          "chicken broth",
          "bay leaf",
          "oregano, cumin"
        ],
        "instructions": [
          "toast the chilles, add the rest of the ingredients, let soften",
          "blend, strain back into liquid"
        ]
      }
    ]
  },
  {
    "name": "Two ingredient pumpkin bread",
    "links": ["https://www.youtube.com/watch?v=IyVYJ-WLVsQ"],
    "categories": ["Simple", "Dessert"],
    "versions": [
      {
        "ingredients": ["Spice cake mix", "pumpkin puree"],
        "instructions": [
          "Mix cake mix and puree in mixer",
          "Bake at 350 for 40 minutes"
        ]
      }
    ]
  },
  {
    "name": "Chili Colorado",
    "links": ["https://www.youtube.com/watch?v=N8bgX6QsAnc"],
    "notes": [
      "official recipe calls for 4 cups stock, 3 was plenty.  Mine was undercooked but I cut larger chunks"
    ],
    "categories": ["Slow Cooker"],
    "versions": [
      {
        "ingredients": [
          "2 pounds chuck roast",
          "3 ancho, 3 guajillo chilies",
          "5-10 chile de arbol (optional)",
          "3 cups beef stock",
          "1 onion",
          "2 teaspoons cumin",
          "1 teaspoon oregano"
        ],
        "instructions": [
          "deseed chilies.  toast and simmer with a cup of beef stock for 20 minutes or more.  Blend well",
          "cut chuck roast into small strips.  Sear.",
          "Put diced onion into pan, deglaze with beef stock",
          "Add all to slow cooker.  2 hours on low.  Uncover, 2 more hours to thicken sauce and finish"
        ]
      }
    ]
  },
  {
    "name": "Brazillian Lemonade",
    "links": ["https://www.youtube.com/watch?v=2hF_w7X4fEY"],
    "categories": ["Dessert"],
    "versions": [
      {
        "ingredients": ["3 limes", "sweetened condensed milk"],
        "instructions": [
          "wash and half three limes, add to blender with water",
          "puree and strain out liquid",
          "Add liquid, sweetened condensed milk and ice to blender",
          "blend and enjoy"
        ]
      }
    ]
  },
  {
    "name": "French Toast Pull Aparts",
    "links": ["https://www.youtube.com/watch?v=sqS3_-MHT0Y"],
    "categories": ["Breakfast", "Simple"],
    "versions": [
      {
        "ingredients": [
          "6 pieces of bread",
          "4 eggs",
          "2 Tbsp Cream (or milk)",
          "1 Tbsp Vanilla",
          "cinnamon"
        ],
        "instructions": [
          "Mix all ingredients in a large bowl other than bread",
          "Cut bread into bite sized pieces, put into bowl and soal up all liquid",
          "Fry the toast"
        ]
      }
    ]
  },
  {
    "name": "Oatmeal Cookies",
    "links": ["https://www.youtube.com/watch?v=4ZeK_iLauko"],
    "categories": ["Simple", "Dessert", "Breakfast"],
    "versions": [
      {
        "ingredients": [
          "bananas",
          "oatmeal",
          "sugar free maple syrup (optional)",
          "peanut butter (optional)"
        ],
        "instructions": [
          "mix and mash all ingrediants",
          "put on parchment paper, smoosh cookies flat",
          "bake at 350 for 20 minutes"
        ]
      }
    ]
  },
  {
    "name": "Air Fryer Pulled Chicken",
    "links": ["https://www.youtube.com/watch?v=NCP6VPf505A"],
    "categories": ["Air Fryer"],
    "versions": [
      {
        "ingredients": [
          "3 chicken breasts",
          "half stick of butter",
          "honey",
          "bbq sauce"
        ],
        "instructions": [
          "Air fry chicken breasts at 390 for 20 minutes, remove and shread with forks",
          "In a pan, mix a half stick of butter, some honey and enough bbq sauce for the chicken, mix with shredded chicken in a bowl",
          "Put back in the air fryer at 390 for 7 minutes"
        ]
      }
    ]
  },
  {
    "name": "Cottage Cheese Ice Cream",
    "links": ["https://www.youtube.com/watch?v=2Mr9GDb30zk"],
    "categories": ["Dessert", "Simple"],
    "versions": [
      {
        "ingredients": [
          "cottage cheese (full fat)",
          "honey (optional)",
          "peanut butter (optional)"
        ],
        "instructions": [
          "blend all ingredients, put into tupperware and freeze",
          "Take out of freezer, pop into microwave and enjoy!"
        ]
      }
    ]
  },
  {
    "name": "Simple Oatmeal Breakfast",
    "links": ["https://www.youtube.com/watch?v=kmqWyyjCjTw"],
    "categories": ["Simple", "Breakfast"],
    "versions": [
      {
        "name": "Main Dish",
        "ingredients": [
          "quick oats",
          "grated apple or applesauce",
          "yogurt (plain or vanilla)",
          "cinnamon"
        ],
        "instructions": [
          "mix quick oats, yogurt, cinnamon and either apple sauce or grated apple in a bowl, let sit for 10 minutes"
        ]
      },
      {
        "name": "(Optional) Toppings",
        "ingredients": [
          "quick oats",
          "almonds",
          "honey or maple syrup",
          "diced apple"
        ],
        "instructions": [
          "Toast almonds, oats and some diced apples",
          "Top bowls with toasted mix and honey or maple sytrup"
        ]
      }
    ]
  },
  {
    "name": "Halal Chicken and Rice",
    "links": ["https://www.youtube.com/watch?v=g728DTEUUlw"],
    "categories": [],
    "versions": [
      {
        "name": "Marinade chicken",
        "ingredients": [
          "boneless skinless chicken thighs",
          "olive oil",
          "dried thyme",
          "dried oregano",
          "garlic powder",
          "onion powder",
          "green cardamom powder",
          "turmeric",
          "paprika",
          "allspice",
          "black pepper",
          "lemon juice"
        ],
        "instructions": [
          "Mix dry ingredients.  Use 1/2 in marinade and save the other half",
          "Mix and marinate until you loose patience"
        ]
      },
      {
        "name": "Sauce",
        "ingredients": [
          "mayo",
          "plain yogurt",
          "lemon juice",
          "garlic powder",
          "salt",
          "(optional) dried flakes like parsley or oregano"
        ],
        "instructions": ["mix"]
      },
      {
        "name": "Chicken and rice",
        "ingredients": ["rice", "(optional) stock"],
        "instructions": [
          "Fry chicken in some oil, remove chicken when cooked",
          "Add rest of seasoning mix, add some more oil, add rice, toast for a bit",
          "Add water or stock, bring to a boil, cover and simmer"
        ]
      },
      {
        "name": "Serve",
        "ingredients": ["Lettuce", "Tomatoes"],
        "instructions": [
          "Dice lettuce and tomatoes",
          "Serve chicken, rice, lettuce, tomatoes and sauce"
        ]
      }
    ]
  },
  {
    "name": "Healthy Blondies",
    "links": ["https://www.youtube.com/watch?v=j9kHJJzXSCc"],
    "notes": [
      "https://www.tiktok.com/@_jacobking/video/7227438764623170842",
      "Recipes disagree on PB amount",
      "There are other recipes with more ingredients.  This is a simple version"
    ],
    "categories": ["Simple", "Dessert", "to try"],
    "versions": [
      {
        "ingredients": [
          "Natural smooth peanut butter, amount varies between 2 1/2 cups or one 16oz jar",
          "2 cans chickpeas, drained",
          "5 tablespoons maple syrup",
          "dark chocolate chips"
        ],
        "instructions": [
          "Mix PB, chickpeats and maple syrup in a food processor",
          "fold in dark chocolate chips",
          "Add to baking pan, bake at 350 for 25 minutes"
        ]
      }
    ]
  },
  {
    "name": "Air Fryer Peruvian Chicken",
    "links": ["https://www.youtube.com/watch?v=1_l6EXvmV-M"],
    "categories": ["Air Fryer"],
    "versions": [
      {
        "ingredients": [
          "4 Chicken Thighs (skin on preferred)",
          "cilantro",
          "lime juice",
          "honey",
          "plain greek yogurt",
          "cumin",
          "paprika",
          "garlic"
        ],
        "instructions": []
      },
      {
        "name": "marinade chicken",
        "ingredients": [
          "3 cloves of garlic, minced",
          "2 tsp paprika",
          "1 tsp cumin",
          "1 tsp salt",
          "1/4 tsp black pepper",
          "lime juice",
          "~2 Tbsp olive oil"
        ],
        "instructions": [
          "Add chicken to a ziploc bag.  Add garlic, paprika, cumin, salt, pepper, lime juice, olive oil.  Massage ingredients into the chicken.  Put into the fridge for a while"
        ]
      },
      {
        "name": "Cilantro Lime Crema Sauce",
        "ingredients": [
          "1 cup of cilantro",
          "1/2 of a jalapeno, deseeded",
          "1 clove garlic",
          "half a cup of greek yogurt (~1 prepackaged cup)",
          "1 tsp honey",
          "1 tsp salt",
          "2 Tbsp olive oil",
          "(optional) mayo",
          "(optional) sour cream"
        ],
        "instructions": [
          "Add cilantro, jalapeno, garlic, yogurt, honey, salt, olive oil to a blender, twister jar is recommended",
          "optionally add mayo and/or sour cream to make creamier",
          "blend, add liquid if blender can't start"
        ]
      },
      {
        "name": "Air fry",
        "ingredients": [],
        "instructions": [
          "Fry up the chicken at 370 for 18-25 minutes depending on chicken size (less for boneless, more for bone-in)"
        ]
      }
    ]
  },
  {
    "name": "Cheat Lemon Pie",
    "links": ["https://www.youtube.com/watch?v=p0W9GuCHMJg"],
    "notes": ["Makes two pies, make sure you have enough room in your freezer"],
    "categories": ["Dessert", "Simple"],
    "versions": [
      {
        "ingredients": [
          "2x Pre-made graham cracker crust (or any crust)",
          "1 carton Cool Whip",
          "1 can sweetened condensed milk",
          "1 can lemonade concentrate, thawed"
        ],
        "instructions": [
          "Combine ingredients into bowl, mix until combined",
          "Pour into pie crusts and freeze"
        ]
      }
    ]
  },
  {
    "name": "Protein Pumpkin Bread",
    "links": ["https://www.youtube.com/watch?v=pIa8FoUk0zI"],
    "categories": ["Simple", "Dessert"],
    "versions": [
      {
        "name": "Wet Ingrediets",
        "ingredients": [
          "2 (4) eggs, mix really well",
          "250g (500g) pumpkin puree",
          "85g (170g) greek yogurt",
          "small amount vanilla extract"
        ]
      },
      {
        "name": "Dry Ingrediets",
        "ingredients": [
          "75g (150g) flour",
          "1 tsp (2 tsp) baking soda",
          "1 tsp (2 tsp) baking powder",
          "1 tsp (2 tsp) salt",
          "45g (90g) sugar substitute (Erythritol or monk fruit or other)",
          "2 (4) packets sweetener (Stevia, Spenda, etc)",
          "50g (100g) whey protein powder (vanilla preferred)",
          "1 tsp (2) pumpkin pie spice"
        ]
      },
      {
        "instructions": [
          "Add wet and dry ingredients to separate bowls",
          "Mix wet and try together",
          "Pour half of mixture into a separate bowl",
          "In one bowl, add the following:",
          "12g (24) cocoa powder",
          "cinnamon",
          "cayenne",
          "2 (4) packets sweetener (Stevia, Splenda, etc)",
          "Alternate pouring the mixtures into 1 (2) loaf pans",
          "Optionally, cut and swirl with a knife in the loaf pan",
          "Bake at 275 for 45 minutes"
        ]
      }
    ]
  },
  {
    "name": "Chicken Shawarma",
    "links": [
      "https://www.youtube.com/watch?v=Qwm2W3ZOfVI",
      "https://www.youtube.com/watch?v=TROZvPHqP1g"
    ],
    "categories": ["to try"],
    "versions": [
      {
        "name": "Spice Marinade",
        "ingredients": [
          "2 tsp garlic powder",
          "1 tsp turmeric ",
          "1 tsp cumin ",
          "1 tsp coriander ",
          "1 tsp all spice ",
          "2 tsp smoked paprika ",
          "1 tsp onion ",
          "1 tsp cardamom ",
          "1/2 tsp clove ",
          "1/2 tsp cayenne pepper",
          "1/2 tsp msg",
          "1 Tbsp sugar ",
          "1.5tsp salt",
          "2 Tbsp olive oil",
          "1.5 Tbsp lemon juice",
          "4 Tbsp white vinegar",
          "2 Tbsp tomato paste",
          "liquid smoke (optional, or use real smoke, see below)"
        ],
        "instructions": [
          "Mix dry ingredients",
          "Add olive oil, lemon juice and tomato paste",
          "optionally, add lemon zest"
        ]
      },
      {
        "name": "Chicken Prep",
        "ingredients": ["2 pounds boneless skinless chicken thighs"],
        "instructions": [
          "Slice thighs into half inch pieces",
          "Marinade overnight"
        ]
      },
      {
        "name": "Toum sauce",
        "ingredients": [
          "1 full bulb of garlic",
          "1 cup neutral oil (corn, canola, vegetable, avocado, grapeseed, sunflower, peanut)",
          "4 Tbsp lemon juice",
          "pinch of salt"
        ],
        "instructions": ["Blend all ingredients together"]
      },
      {
        "name": "Make fries (optional)",
        "ingredients": ["frozen fries"],
        "instructions": [
          "Make some frensh friend in the air frier.  Goes well in/with Shawarma"
        ]
      },
      {
        "name": "Cooking the chicken",
        "ingredients": ["dill relish or sliced pickes"],
        "instructions": [
          "Slice some dill pickles if you don't have dill relish",
          "Sear the chicken on high heat.  Don't crowd the pan.  Allow a crust to develop"
        ]
      },
      {
        "name": "Smoke  the chicken (optional)",
        "ingredients": [
          "Pan with cover",
          "Charcoal from indian / middle eastern"
        ],
        "instructions": [
          "In a pan which has a cover, move the chicken to the edges to clear a cirlce in the center of the pan",
          "Line a very small ramakin with aluminium foil.  Add neutral oil to the ramakin, put the ramakin in the center of the pan",
          "Move the pan outside",
          "Light a small charcoal and put it into the oil.  The oil will burn and make smoke.  Cover your pan.  Let the meat smoke for 5-10 minutes"
        ]
      },
      {
        "name": "Final Assembly",
        "ingredients": [
          "dill relish or sliced pickes",
          "pomegranite molassses",
          "french fries",
          "pitas",
          "parchment paper",
          "aluminum foil"
        ],
        "instructions": [
          "Add pita to pan to soak leftover chicken fat, spread toum sauce on pita in pan, add chicken and sliced dill pickles",
          "Add fries (optional)",
          "Add pomegranite molassses (optional)",
          "Wrap pita in parchment paper",
          "Wrap pita in aluminum foil, heat in pan, slice diagonally",
          "Serve with Toum"
        ]
      }
    ]
  },
  {
    "name": "Simple Chicken Thighs",
    "links": ["https://www.youtube.com/watch?v=fks2SyKc0gs"],
    "categories": ["Simple"],
    "notes": ["Good simple recipe"],
    "versions": [
      {
        "name": "marinade",
        "ingredients": [
          "3-4 pounds boneless skinless chicken thighs",
          "2 Tbsp olive oil",
          "1 Tbsp sesame oil",
          "4 Tbsp soy sauce",
          "1 Tbsp W sauce",
          "2 Tbsp lemon juice",
          "5 Tbsp honey or maple syrup",
          "3 Tbsp minced garlic (or more)",
          "black pepper 1/2 tsp",
          "2 tsp salt"
        ],
        "instructions": [
          "Marinade chicken thighs overnight or longer",
          "Add to baking pan and bake at 400 for 35 minutes",
          "Put under broiler for 7 minutes"
        ]
      }
    ]
  },
  {
    "name": "Chicken and Potatoes, middle eastern style",
    "links": ["https://www.youtube.com/watch?v=oz0psDghfDw"],
    "categories": ["Cold Weather", "to try"],
    "versions": [
      {
        "name": "Spice Blend",
        "ingredients": [
          "1 Tbp paprika",
          "1 Tbsp Chili powder",
          "1 Tbsp garlic powder",
          "1 Tbsp salt",
          "1 tsp cumin"
        ]
      },
      {
        "name": "Marinade",
        "ingredients": [
          "1 lemon",
          "1 bulb garlic",
          "1 shallot",
          "1 bundle cilantro (reserve 1/4 for next day)",
          "1 tsp fresh rosemary",
          "1 tsp fresh thyme",
          "1 tsp fresh sage",
          "half of the spice blend",
          "1/4 cup olive oil",
          "1/4 cup white vinegar",
          "lemon juice",
          "5 pounts chicken thighs and drums"
        ],
        "instructions": [
          "To a blender add lemon zest and its juice",
          "garlic",
          "shallot",
          "cilantro",
          "rosemary",
          "thyme",
          "sage",
          "spice blend",
          "olive oil",
          "blend it up",
          "Marinade chicken overnight"
        ]
      },
      {
        "name": "the next day",
        "ingredients": ["3-4 large potatoes", "Sheet pan", "aluminum foil"],
        "instructions": [
          "Slice the potatoes into chunks, line a sheet tray, add olive oil and some of remaining spice blend",
          "Add chicken and marinade on top of potatoes",
          "Add remaining spice blend on top",
          "Cover with aluminum foil",
          "Bake at 375 for 40 minutes, remove foil, put back into oven",
          "Add minced garlic to a pan, cook for a minute, then add lemon juice and chopped cilantro, add this mixture to the top of your chicken"
        ]
      }
    ]
  },
  {
    "name": "Cottage Cheese Pancakes",
    "links": ["https://www.youtube.com/watch?v=pLyDIG9VOgw"],
    "notes": [
      "I deviated from the recipe and added more flour.  I am reducing the number of eggs here too because it was a bit too eggy"
    ],
    "categories": ["Breakfast"],
    "versions": [
      {
        "ingredients": [
          "1 cup cottage cheese",
          "2 eggs",
          "3/4 cup flour",
          "1 tsp baking powder"
        ],
        "instructions": ["Blend all ingredients together"]
      }
    ]
  },
  {
    "name": "Slow Cooker Beef",
    "links": ["https://www.youtube.com/watch?v=m_GZ-0GI2FQ"],
    "categories": ["Slow Cooker", "to try"],
    "versions": [
      {
        "ingredients": [
          "instant pot (slow cooker OK)",
          "Chuck Roast",
          "beef flavoring (2 Tbsp Beef Better than Bouillon preferred, 2 cans beef broth or cubes OK)",
          "Onion (white preferred, yellow OK)",
          "Mushrooms (cremini, aka baby bella preferred, white button OK)",
          "garlic, 18 cloves (yes, a lot)",
          "3 Tbsp Dutch Process cocoa powder (regular OK)",
          "3 Tbsp salt",
          "Black Pepper"
        ],
        "instructions": [
          "Trim excess fat from roast, salt and leave out",
          "Slice onion",
          "clean and slice mushrooms",
          "mince the garlic",
          "dry and sear beef in instant pot or pan",
          "Add 2 Tbsp Better than Bouillon to two cups of water, or cubes",
          "Add cocoa powder to liquid",
          "Add salt to liquid",
          "Remove meat from pot, add sliced onions with salt, brown just a bit",
          "Add sliced mushrooms to pot, mix, cook a bit",
          "Add minced garlic to pot, mix, cook a bit",
          "Add meat back in the top of pot, add broth",
          "If meat not covered, add water to cover meat",
          "Add a lot of black pepper to pot",
          "Cover and cook for six hours on low.  Don't use as pressure cooker"
        ]
      }
    ]
  },
  {
    "name": "",
    "links": [""],
    "categories": [],
    "versions": [
      {
        "ingredients": [],
        "instructions": []
      }
    ]
  }
]
